{
  "__comment_type": "The type of skybox that this is.  String containing either 'color' or 'textured'.  Required.",
  "type": "textured",
  "__comment_texture": "The texture used for the custom skybox.  Requires full identifier path to each texture.  Textures should be square in resolution.  Required.",
  "texture_north": "textures/block/beacon.png",
  "texture_south": "textures/block/beacon.png",
  "texture_east": "textures/block/beacon.png",
  "texture_west": "textures/block/beacon.png",
  "texture_top": "textures/block/beacon.png",
  "texture_bottom": "textures/block/beacon.png",
  "__comment_axis": "The rotation of the skybox.  Set to [0, 0] to disable.  Takes a array of two integers between -180 and 180.  Required.",
  "axis": [
    0,
    0
  ],
  "__comment_shouldRotate": "Whether the skybox should rotate on its axis.  Boolean.  Optional.  Default false",
  "shouldRotate": false,
  "__comment_fadeTimes": "The times, in ticks, when a skybox will fade in/out.  Integers.  Required.",
  "startFadeIn": 1000,
  "endFadeIn": 2000,
  "startFadeOut": 3000,
  "endFadeOut": 4000,
  "__comment_maxAlpha": "The maximum that the alpha can be.  Float between 0-1.  Optional.  Default 1.",
  "maxAlpha": 1,
  "__comment_transitionSpeed": "The speed that skyboxes will fade in/out when passing into/out of valid conditions.  Float between 0-1.  Optional.  Default 1",
  "transitionSpeed": 1,
  "__comment_weather": "The weather that the skybox can show up in.  Can be a array of strings or a single string representing the weather (clear, rain, thunder, snow).  Optional.  By default weather check is disabled.",
  "weather": [
    "clear",
    "rain",
    "thunder",
    "snow"
  ],
  "__comment_dimensions": "The dimensions that the skybox can show up in.  Can be a array of strings or a single string representing a identifier.  Optional.  By default dimensions check is disabled.",
  "dimensions": "overworld",
  "__comment_biomes": "The biomes that the skybox can show up in.  Can be a array of strings or a single string representing a identifier.  Optional.  By default biomes check is disabled.",
  "biomes": "plains",
  "__comment_heightRanges": "The height ranges that the skybox can show up in.  Array containing arrays of float ranges.  Optional.  By default height range check is disabled.",
  "heightRanges": [
    [
      100,
      150
    ],
    [
      50,
      70
    ]
  ]
}